In [1]:
import pandas as pd
import os
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
pwd

'C:\\Users\\S54201'

In [3]:
path = 'C:\\Users\\S54201\\Downloads\\BlackFriday'

In [4]:
os.chdir(path)

In [5]:
pwd

'C:\\Users\\S54201\\Downloads\\BlackFriday'

In [6]:
df = pd.read_csv('train.csv')

In [7]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [8]:
df.Age.value_counts()

26-35    219587
36-45    110013
18-25     99660
46-50     45701
51-55     38501
55+       21504
0-17      15102
Name: Age, dtype: int64

In [9]:
df.shape

(550068, 12)

In [10]:
df_test = pd.read_csv('test.csv')

In [11]:
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [12]:
df = df.append(df_test)

<ipython-input-12-608405a3d46b>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df_test)

In [13]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     783667 non-null  int64
 1   Product_ID                  783667 non-null  object
 2   Gender                      783667 non-null  object
 3   Age                         783667 non-null  object
 4   Occupation                  783667 non-null  int64
 5   City_Category               783667 non-null  object
 6   Stay_In_Current_City_Years  783667 non-null  object
 7   Marital_Status              783667 non-null  int64
 8   Product_Category_1          783667 non-null  int64
 9   Product_Category_2          537685 non-null  float64
 10  Product_Category_3          237858 non-null  float64
 11  Purchase                    550068 non-null  float64
dtypes: float64(3), int64(4), object(5)
memory usage: 77.7+ MB

In [15]:
df.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,7.836670e+05,783667.000000,783667.000000,783667.000000,537685.000000,237858.000000,550068.000000
mean,1.003029e+06,8.079300,0.409777,5.366196,9.844506,12.668605,9263.968713
std,1.727267e+03,6.522206,0.491793,3.878160,5.089093,4.125510,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001519e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003075e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [16]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
dtype: int64

In [17]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [18]:
df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].str.replace('+','')

<ipython-input-18-9f60e03f2c04>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].str.replace('+','')

In [19]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4', '3', '1', '0'], dtype=object)

In [20]:
df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].astype(int)

In [21]:
df['Stay_In_Current_City_Years'].unique()

array([2, 4, 3, 1, 0])

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     783667 non-null  int64
 1   Product_ID                  783667 non-null  object
 2   Gender                      783667 non-null  object
 3   Age                         783667 non-null  object
 4   Occupation                  783667 non-null  int64
 5   City_Category               783667 non-null  object
 6   Stay_In_Current_City_Years  783667 non-null  int32
 7   Marital_Status              783667 non-null  int64
 8   Product_Category_1          783667 non-null  int64
 9   Product_Category_2          537685 non-null  float64
 10  Product_Category_3          237858 non-null  float64
 11  Purchase                    550068 non-null  float64
dtypes: float64(3), int32(1), int64(4), object(4)
memory usage: 74.7+ MB

In [23]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4,0,8,NaN,NaN,7969.0

In [24]:
X = df.iloc[:,:-1]

In [25]:
X.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN
4,1000002,P00285442,M,55+,16,C,4,0,8,NaN,NaN

In [26]:
y = df['Purchase']

In [27]:
y

0          8370.0
1         15200.0
2          1422.0
3          1057.0
4          7969.0
           ...
233594        NaN
233595        NaN
233596        NaN
233597        NaN
233598        NaN
Name: Purchase, Length: 783667, dtype: float64

In [28]:
#df.drop(['User_ID'],axis=1,inplace=True)

In [29]:
#df['Gender'] = df['Gender'].map({'F':0,'M':1})

In [30]:
#df_test = df.loc[:,['User_ID','Gender', 'Age']]

In [31]:
#df_test.head()

In [32]:
from sklearn.preprocessing import OneHotEncoder, OrdinalEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer
import numpy as np

In [37]:
ohe = OneHotEncoder()
oe = OrdinalEncoder(categories=[['0-17','18-25','26-35','36-45','46-50','51-55','55+']])
imp = SimpleImputer()

In [38]:
ct = make_column_transformer(
    (ohe, ['Gender']),
    (oe, ['Age']),
    ('drop', ['User_ID', 'Product_ID', 'City_Category']),
    (imp,['Product_Category_2', 'Product_Category_3']),
    remainder = 'passthrough')

In [39]:
dft = ct.fit_transform(X)

In [ ]:
#ct.get_feature_names() --oe dun give features name

In [40]:
dft

array([[ 1.,  0.,  0., ...,  2.,  0.,  3.],
       [ 1.,  0.,  0., ...,  2.,  0.,  1.],
       [ 1.,  0.,  0., ...,  2.,  0., 12.],
       ...,
       [ 1.,  0.,  2., ...,  4.,  1.,  1.],
       [ 1.,  0.,  4., ...,  4.,  0., 10.],
       [ 1.,  0.,  4., ...,  4.,  1.,  4.]])

In [44]:
df['Gender'].unique()

array(['F', 'M'], dtype=object)

In [41]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [42]:
dft[0]

array([ 1.        ,  0.        ,  0.        ,  9.84450561, 12.6686048 ,
       10.        ,  2.        ,  0.        ,  3.        ])

In [43]:
X.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [46]:
dft = pd.DataFrame(dft, columns= ['F', 'M', 'Age', 'Occupation','Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1','Product_Category_2','Product_Category_3'])

In [47]:
dft

,F,M,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1.0,0.0,0.0,9.844506,12.668605,10.0,2.0,0.0,3.0
1,1.0,0.0,0.0,6.000000,14.000000,10.0,2.0,0.0,1.0
2,1.0,0.0,0.0,9.844506,12.668605,10.0,2.0,0.0,12.0
3,1.0,0.0,0.0,14.000000,12.668605,10.0,2.0,0.0,12.0
4,0.0,1.0,6.0,9.844506,12.668605,16.0,4.0,0.0,8.0
...,...,...,...,...,...,...,...,...,...
783662,1.0,0.0,2.0,9.844506,12.668605,15.0,4.0,1.0,8.0
783663,1.0,0.0,2.0,8.000000,12.668605,15.0,4.0,1.0,5.0
783664,1.0,0.0,2.0,5.000000,12.000000,15.0,4.0,1.0,1.0
783665,1.0,0.0,4.0,16.000000,12.668605,1.0,4.0,0.0,10.0
783666,1.0,0.0,4.0,5.000000,12.668605,0.0,4.0,1.0,4.0